knyghtryda/oepl-cc2630-firmware/firmware/main.c
// -----------------------------------------------------------------------------
//     CC2630 OEPL Tag Firmware
// -----------------------------------------------------------------------------
// Full OEPL tag: scan → checkin → block download → display
// Uses SEGGER RTT for debug output via J-Link.
// -----------------------------------------------------------------------------

#include <stdint.h>
#include <string.h>
#include "rtt.h"
#include "oepl_rf_cc2630.h"
#include "oepl_radio_cc2630.h"
#include "oepl_hw_abstraction_cc2630.h"
#include "drivers/oepl_display_driver_uc8159_600x448.h"
#include "splash.h"
#include "oepl_ota_cc2630.h"
#include "inflate.h"
#include "fault.h"

// TI driverlib
#include "sys_ctrl.h"

// PRCM registers (now from driverlib includes via sys_ctrl.h)
#include "prcm.h"
#include "hw_memmap.h"
#include "hw_prcm.h"

// RTC-timed sleep
#include "aon_rtc.h"

// Deep sleep: AON wakeup controller, event routing, interrupts, IO latch
#include "aon_wuc.h"
#include "aon_event.h"
#include "interrupt.h"
#include "hw_ints.h"
#include "aon_ioc.h"
#include "hw_rfc_pwr.h"
#include "ioc.h"
#include "gpio.h"
#include "aux_wuc.h"
#include "osc.h"
#include "vims.h"
#include "ddi.h"
#include "hw_ddi_0_osc.h"
#include "hw_aon_wuc.h"
#include "watchdog.h"

// Block buffers for image download (4100 bytes each: 4-byte header + 4096 data)
// bw_buf: cached B/W block (also used by OTA), red_buf: cached Red block
uint8_t bw_buf[BLOCK_XFER_BUFFER_SIZE];
static uint8_t red_buf[BLOCK_XFER_BUFFER_SIZE];
static int8_t bw_cache_id, red_cache_id;  // which block ID is cached (-1 = none)

// Warm boot detection: .noinit survives WFI return path (debug tag with JLink).
// Hardware reset source covers full standby wakeup (battery tag, no debugger).
#define WARMBOOT_MAGIC_A 0xDEE5BEEF
#define WARMBOOT_MAGIC_B 0x2116CAFE
__attribute__((section(".noinit"))) static volatile uint32_t warmboot_magic_a;
__attribute__((section(".noinit"))) static volatile uint32_t warmboot_magic_b;

static void delay_cycles(volatile uint32_t n)
{
    while (n--) {
        if ((n & 0xFFFF) == 0) oepl_hw_wdt_kick();
        __asm volatile ("nop");
    }
}

// AON RTC interrupt handler — wakes CPU from deep sleep (WFI).
// Overrides the weak alias to Default_Handler in startup_cc2630.c.
// Without this ISR and IntEnable(INT_AON_RTC_COMB), WFI hangs forever
// because the Cortex-M3 requires an NVIC-enabled interrupt to wake.
void AON_RTC_Handler(void)
{
    AONRTCEventClear(AON_RTC_CH0 | AON_RTC_CH2);   // CH2: idle tick (oepl_hw_idle)
}

// Enter standby with RTC-timed wakeup.
//
// Sequence follows TI's PowerCC26XX.c Power_sleep() step for step: IOs
// frozen, crystal off, AUX allowed to sleep, RF/serial/peripheral/CPU domains
// off, uLDO requested, VIMS cache off, recharge configured, SLEEPDEEP + WFI.
// Execution resumes after PRCMDeepSleep() on wakeup; the wake path undoes it
// in TI's order (AUX must be back on before anything touches OSC/DDI).
//
// Measured on the bench (PPK2, debugger detached): the previous version,
// which powered off PERIPH only, sat at ~1.8 mA while "asleep".
//
// With a debugger attached the JTAG domain stays on, which prevents standby:
// WFI then simply returns and the wake path runs anyway.
static bool debugger_attached(void)
{
    return (HWREG(0xE000EDF0) & 0x1) != 0;   // CoreDebug DHCSR.C_DEBUGEN
}

// Once SCLK_LF runs from the 32 kHz crystal, bypass the LF clock qualifiers
// (as TI's PowerCC26XX driver does). The qualifier measures the LF clock
// against the HF oscillator, which keeps HF running and blocks standby:
// measured ~1.2 mA "asleep" with them active.
static bool lf_qualifiers_bypassed;
#ifdef DIAG_SLEEP_ONLY
__attribute__((section(".noinit"), used)) static uint32_t sleep_snap[16];
#endif
static void lf_clock_finalize(void)
{
    if (lf_qualifiers_bypassed) return;
    if (OSCClockSourceGet(OSC_SRC_CLK_LF) != OSC_XOSC_LF) return;   // not switched yet
    DDI16BitfieldWrite(AUX_DDI0_OSC_BASE, DDI_0_OSC_O_CTL0,
                       DDI_0_OSC_CTL0_BYPASS_XOSC_LF_CLK_QUAL_M |
                       DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_M,
                       DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_S, 0x3);
    OSCClockLossEventEnable();
    lf_qualifiers_bypassed = true;
    rtt_puts("LF clock on XOSC_LF, qualifiers bypassed\r\n");
}

static void enter_sleep(uint32_t seconds)
{
    lf_clock_finalize();

    rtt_puts("SLEEP ");
    rtt_put_hex8((seconds >> 8) & 0xFF);
    rtt_put_hex8(seconds & 0xFF);
    rtt_puts("s\r\n");

    // Shut down RF core (main loop will re-init after wakeup)
    oepl_rf_shutdown();

    // Idle tick off, or it would wake the tag out of standby every 2 ms
    oepl_hw_idle_tick(false);

    // Configure RTC wakeup (16.16 fixed-point format: seconds in upper 16 bits)
    AONRTCEnable();
    uint32_t now = AONRTCCurrentCompareValueGet();
    uint32_t target = now + (seconds << 16);
    AONRTCCompareValueSet(AON_RTC_CH0, target);
    AONRTCChannelEnable(AON_RTC_CH0);
    AONRTCEventClear(AON_RTC_CH0);

    // Combined event drives INT_AON_RTC_COMB; without it WFI never wakes.
    AONRTCCombinedEventConfig(AON_RTC_CH0);
    IntPendClear(INT_AON_RTC_COMB);
    IntEnable(INT_AON_RTC_COMB);

    // Save warm boot magic (covers a fault/reset during or after sleep)
    warmboot_magic_a = WARMBOOT_MAGIC_A;
    warmboot_magic_b = WARMBOOT_MAGIC_B;

    // Route RTC CH0 to MCU wakeup event
    AONEventMcuWakeUpSet(AON_EVENT_MCU_WU0, AON_EVENT_RTC_CH0);

    bool dbg = debugger_attached();
    rtt_puts(dbg ? "SLEEP WFI (debugger: no standby)\r\n" : "SLEEP standby\r\n");
    // --- no RTT/peripheral/AUX access from here until the wake path restores it ---

    // Step numbers follow TI's PowerCC26XX.c Power_sleep() (cc26x0).
#ifdef DIAG_SLEEP_ONLY
    sleep_snap[1] = HWREG(AUX_DDI0_OSC_BASE + DDI_0_OSC_O_CTL0);   // AUX still on here
#endif
    // 1. Freeze the IOs on the boundary between MCU and AON
    AONIOCFreezeEnable();
    // 2. If XOSC_HF is active, force it off (RF init switches it back on)
    if (OSCClockSourceGet(OSC_SRC_CLK_HF) == OSC_XOSC_HF) {
        OSCHF_SwitchToRcOscTurnOffXosc();
    }
    // 3. Allow AUX to power down (it is forced on at boot and after each
    //    wake; a forced-on AUX blocks standby -- read back as AUXCTL=1)
    AONWUCAuxWakeupEvent(AONWUC_AUX_ALLOW_SLEEP);
    // 4. Make sure writes take effect
    SysCtrlAonSync();
    // 7. Clock settings take effect
    PRCMLoadSet();
    // 8. Request power off of the MCU-voltage-domain domains
    PRCMPowerDomainOff(PRCM_DOMAIN_RFCORE | PRCM_DOMAIN_SERIAL |
                       PRCM_DOMAIN_PERIPH | PRCM_DOMAIN_CPU);
    // 9. Request uLDO during standby (VDCTL.ULDO; without it the chip only
    //    reaches deep sleep on the main regulator, ~1 mA measured)
    PRCMMcuUldoConfigure(true);
    // 10. VIMS cache off and not retained
    uint32_t modeVIMS;
    do { modeVIMS = VIMSModeGet(VIMS_BASE); } while (modeVIMS == VIMS_MODE_CHANGING);
    if (modeVIMS == VIMS_MODE_ENABLED) VIMSModeSet(VIMS_BASE, VIMS_MODE_OFF);
    PRCMCacheRetentionDisable();
    // 11. Recharge parameters
    SysCtrlSetRechargeBeforePowerDown(XOSC_IN_HIGH_POWER_MODE);
    // 12. Make sure all writes have taken effect
    SysCtrlAonSync();

#ifdef DIAG_SLEEP_ONLY
    // Snapshot of the power configuration at the moment of sleep (noinit)
    sleep_snap[0]++;
    sleep_snap[3] = HWREG(AON_WUC_BASE + AON_WUC_O_PWRSTAT);
    sleep_snap[4] = HWREG(AON_WUC_BASE + AON_WUC_O_CTL0);
    sleep_snap[5] = HWREG(AON_WUC_BASE + AON_WUC_O_JTAGCFG);
    sleep_snap[7] = HWREG(PRCM_BASE + PRCM_O_PDSTAT0);
    sleep_snap[8] = HWREG(PRCM_BASE + PRCM_O_PDSTAT1);
    sleep_snap[10] = HWREG(PRCM_BASE + PRCM_O_PDCTL1);
    sleep_snap[11] = HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL);
    sleep_snap[14] = HWREG(PRCM_BASE + PRCM_O_VDCTL);
    sleep_snap[15] = 0x5AFE5AFE;
#endif
    (void)dbg;

    // 13. Invoke deep sleep to go to STANDBY
    PRCMDeepSleep();

    // --- Wake ---
    // 14. Restore VIMS and cache retention
    if (modeVIMS == VIMS_MODE_ENABLED) VIMSModeSet(VIMS_BASE, modeVIMS);
    PRCMCacheRetentionEnable();
    // 15. Start forcing power to AUX
    AONWUCAuxWakeupEvent(AONWUC_AUX_WAKEUP);
    // 16. Re-power the peripheral domains we use (RF core stays off until RF init)
    PRCMPowerDomainOn(PRCM_DOMAIN_SERIAL | PRCM_DOMAIN_PERIPH);
    // 18. Clock settings take effect
    PRCMLoadSet();
    // 19. Release request for uLDO
    PRCMMcuUldoConfigure(false);
    // 21. Wait until the domains are back on
    for (volatile uint32_t i = 0; i < 2000000; i++)
        if (PRCMPowerDomainStatus(PRCM_DOMAIN_SERIAL | PRCM_DOMAIN_PERIPH) == PRCM_DOMAIN_POWER_ON)
            break;
    // 22. RTC shadow values up to date
    SysCtrlAonSync();
    // 24. Disable IO freeze
    AONIOCFreezeDisable();
    SysCtrlAonSync();
    // 25. Wait for AUX to power up (everything OSC/DDI-related needs it)
    for (volatile uint32_t i = 0; i < 5000000; i++)
        if (AONWUCPowerStatusGet() & AONWUC_AUX_POWER_ON) break;
    SysCtrlAdjustRechargeAfterPowerDown(0);

    warmboot_magic_a = 0;
    warmboot_magic_b = 0;
    IntDisable(INT_AON_RTC_COMB);
    IntPendClear(INT_AON_RTC_COMB);
    AONRTCEventClear(AON_RTC_CH0);

    // GPIO clock back on
    PRCMPeripheralRunEnable(PRCM_PERIPH_GPIO);
    PRCMLoadSet();
    for (volatile uint32_t i = 0; i < 500000; i++)
        if (PRCMLoadGet()) break;

