knyghtryda/oepl-cc2630-firmware/firmware/main.c
    rtt_puts("WAKE\r\n");
}

// Retry interval after `streak` consecutive failures: RETRY_MIN_S doubling,
// capped at RETRY_MAX_S (see the main loop)
#ifndef RETRY_MIN_S
#define RETRY_MIN_S 30
#endif
#ifndef RETRY_MAX_S
#define RETRY_MAX_S 900
#endif
static uint32_t retry_backoff_s(uint8_t streak)
{
    uint32_t s = RETRY_MIN_S;
    while (streak-- > 0 && s < RETRY_MAX_S) s <<= 1;
    return s > RETRY_MAX_S ? RETRY_MAX_S : s;
}

static void print_mac_msb(const uint8_t *mac_lsb)
{
    // Print MAC in human-readable MSB-first order (reverse of wire order)
    for (int i = 7; i >= 0; i--) {
        rtt_put_hex8(mac_lsb[i]);
        if (i > 0) rtt_puts(":");
    }
}

static bool do_scan_and_checkin(struct AvailDataInfo *info)
{
    // Scan for AP
    rtt_puts("\r\n--- SCAN ---\r\n");
    int8_t ch = oepl_radio_scan_channels();
#ifdef BENCH_FORCE_SCAN_FAIL
    ch = -1;   // bench: exercise the direct check-in fallback
#endif
    if (ch < 0) {
        // Try direct checkin on all channels as fallback
        rtt_puts("Direct checkin...\r\n");
        for (uint8_t c = 0; c < OEPL_NUM_CHANNELS; c++) {
            rf_status_t rc = oepl_rf_set_channel(c);
            if (rc != RF_OK) continue;

            uint8_t ieee_ch = oepl_channel_map[c];
            radio_state_t *rst = oepl_radio_get_state();
            rst->current_channel = c;
            rst->current_ieee_ch = ieee_ch;
            rst->ap_found = true;
            memset(rst->ap_mac, 0xFF, 8);

            rtt_puts("Ch ");
            rtt_put_hex8(ieee_ch);
            rtt_puts(": ");
            if (oepl_radio_checkin(info)) return true;
        }
        return false;
    }

    // AP found, do checkin
    rtt_puts("AP found, checkin...\r\n");
    return oepl_radio_checkin(info);
}

// Check the BlockData header the AP prepends to each block: data length and
// a 16-bit sum of the data bytes. This catches a known AP failure mode where
// the C6 radio's request to the ESP32 is dropped and it serves the previous
// block's contents relabelled with the new block id.
static bool block_checksum_ok(const uint8_t *buf, uint32_t expected_len)
{
    const struct BlockData *bd = (const struct BlockData *)buf;
    if (bd->size != expected_len) return false;
    uint16_t sum = 0;
    for (uint32_t i = 0; i < expected_len; i++)
        sum += buf[BLOCK_HEADER_SIZE + i];
    return sum == bd->checksum;
}

#define BLOCK_EMPTY_LIMIT 6

// Download a specific block into a buffer, with retries
// Accumulates parts across attempts — missing parts requested on retry
bool download_block(uint8_t block_id, struct AvailDataInfo *info,
                    uint8_t *buf, uint16_t *out_size)
{
    rtt_puts("B");
    rtt_put_hex8(block_id);

    uint8_t parts_rcvd[BLOCK_REQ_PARTS_BYTES];
    memset(parts_rcvd, 0, sizeof(parts_rcvd));
    memset(buf, 0x00, BLOCK_XFER_BUFFER_SIZE);

    uint32_t remaining = info->dataSize - (uint32_t)block_id * BLOCK_DATA_SIZE;
    uint32_t data_len = (remaining > BLOCK_DATA_SIZE) ? BLOCK_DATA_SIZE : remaining;

    uint8_t zero_count = 0;  // consecutive attempts with 0 parts received
    for (uint8_t attempt = 0; attempt < 15; attempt++) {
        if (attempt > 0) {
            rtt_puts("R");
            // After an empty response (no ACK, no parts) the AP is usually
            // busy -- e.g. its ESP32 rendering another tag's content -- for
            // seconds, not milliseconds: give it growing pauses.
            oepl_hw_delay_ms(zero_count ? 500UL * zero_count : 100);
        }
        uint8_t got = oepl_radio_request_block(block_id, info->dataVer, info->dataType,
                                                buf, parts_rcvd);
        // Accept 41/42 only after 8 attempts
        bool complete = (got >= BLOCK_MAX_PARTS) ||
                        (got >= BLOCK_MAX_PARTS - 1 && attempt >= 7);
        if (complete) {
            if (block_checksum_ok(buf, data_len)) {
                rtt_puts(got >= BLOCK_MAX_PARTS ? "+" : "~");
                *out_size = BLOCK_XFER_BUFFER_SIZE;
                return true;
            }
            // Wrong contents: start over with a full (forced) request so the
            // AP re-fetches the block rather than resending its buffer.
            rtt_puts("C!");
            memset(parts_rcvd, 0, sizeof(parts_rcvd));
            continue;
        }
        // If the AP isn't responding at all, give up after BLOCK_EMPTY_LIMIT
        // empty responses in a row (~20 s of patience with the pauses above;
        // 3 wasn't enough to ride out routine AP stalls on the bench)
        if (got == 0) {
            zero_count++;
            if (zero_count >= BLOCK_EMPTY_LIMIT) {
                rtt_puts("X");
                break;
            }
        } else {
            zero_count = 0;
        }
    }
    rtt_puts("!");
    return false;
}

// Ensure a block is in the B/W cache.
// On download failure, fills buffer with white (0x00) and caches the block ID
// to avoid re-attempting the same failed block on every row.
static bool ensure_bw_block(uint8_t block_id, struct AvailDataInfo *info)
{
    if (bw_cache_id == block_id) return true;
    uint16_t sz;
    if (!download_block(block_id, info, bw_buf, &sz)) {
        memset(bw_buf, 0x00, BLOCK_XFER_BUFFER_SIZE);
        bw_cache_id = block_id;
        return false;
    }
    bw_cache_id = block_id;
    return true;
}

// Ensure a block is in the Red cache.
// On download failure, fills buffer with 0x00 (no red) and caches.
static bool ensure_red_block(uint8_t block_id, struct AvailDataInfo *info)
{
    if (red_cache_id == block_id) return true;
    uint16_t sz;
    if (!download_block(block_id, info, red_buf, &sz)) {
        memset(red_buf, 0x00, BLOCK_XFER_BUFFER_SIZE);
        red_cache_id = block_id;
        return false;
    }
    red_cache_id = block_id;
    return true;
}

// Count of blocks that failed download (reset before each image)
static uint8_t dl_failed_blocks;

// Get bytes from the image at a given offset, using cached blocks.
// Each block has a 4-byte BlockData header (size + checksum) followed by
// BLOCK_DATA_SIZE bytes of actual image data. We skip the header.
// On block download failure, uses white data (ensure_*_block fills buffer).
static void get_image_bytes(uint32_t offset, uint8_t *out, uint16_t len,
                             struct AvailDataInfo *info, bool is_red_plane)
{
    while (len > 0) {
        // A failed block means the image won't be shown (see
        // download_and_display): stop fetching the rest
        if (dl_failed_blocks >= 1) {
            memset(out, 0x00, len);
            return;
        }

        uint8_t block_id = (uint8_t)(offset / BLOCK_DATA_SIZE);
        uint16_t block_off = (uint16_t)(offset % BLOCK_DATA_SIZE);
        uint16_t avail = (uint16_t)BLOCK_DATA_SIZE - block_off;
        if (avail > len) avail = len;

        uint8_t *cache;
        if (is_red_plane) {
            if (!ensure_red_block(block_id, info)) dl_failed_blocks++;
            cache = red_buf;
        } else {
            if (!ensure_bw_block(block_id, info)) dl_failed_blocks++;
            cache = bw_buf;
        }

        // Skip BLOCK_HEADER_SIZE (4 bytes) at start of each block
        memcpy(out, &cache[BLOCK_HEADER_SIZE + block_off], avail);
        out += avail;
        offset += avail;
        len -= avail;
    }
}

// Convert 1 byte B/W + 1 byte Red (8 pixels) to 4 bytes of 4bpp UC8159
// B/W: bit=1 → black, bit=0 → white. Red: bit=1 → red (overrides B/W)
// UC8159 4bpp: 0x0=black, 0x3=white, 0x4=red
static void bwr_to_4bpp(uint8_t bw, uint8_t red, uint8_t out[4])
{
    for (uint8_t i = 0; i < 4; i++) {
        uint8_t hi_bw  = (bw >> 7) & 1;
        uint8_t hi_red = (red >> 7) & 1;
        uint8_t lo_bw  = (bw >> 6) & 1;
        uint8_t lo_red = (red >> 6) & 1;

        uint8_t hi_nib = hi_red ? 0x4 : (hi_bw ? 0x0 : 0x3);
        uint8_t lo_nib = lo_red ? 0x4 : (lo_bw ? 0x0 : 0x3);

