knyghtryda/oepl-cc2630-firmware/firmware/main.c
        // 3. the plane the panel is fed from, a row at a time
        uint32_t n = len;
        for (uint32_t i = 0; i < n; i++) {
            zsink.row[zsink.row_len++] = data[i];
            if (zsink.row_len == row_bytes) {
                if (zsink.row_y >= DISPLAY_HEIGHT_600X448) {
                    zsink.failed = true;
                    return false;
                }
                zsink_emit_row();
            }
        }
        data += n; len -= n; zsink.off += n;
    }
    return !zsink.failed;
}

// Stage a compressed image in flash, decode it into the panel, refresh.
// Returns true only if the whole stream decoded and checksummed.
static bool download_and_display_zlib(struct AvailDataInfo *info)
{
    rtt_puts("ZIMG: staging ");
    rtt_put_hex32(info->dataSize);
    rtt_puts(" bytes\r\n");

    if (!oepl_ota_stage_download(info, IMG_ZLIB_IN_ADDR, IMG_ZLIB_IN_MAX))
        return false;

    oepl_flash_cache_invalidate();
    const uint8_t *in = (const uint8_t *)IMG_ZLIB_IN_ADDR;
    uint32_t total = (uint32_t)in[0] | ((uint32_t)in[1] << 8) |
                     ((uint32_t)in[2] << 16) | ((uint32_t)in[3] << 24);

    memset(&zsink, 0, sizeof(zsink));

    rtt_puts("EPD wake...");
    uc8159_wake();
    rtt_puts("OK\r\n");

    uint32_t produced = 0;
    // red_buf is the decoder's 4 KB window: nothing else needs it here, and a
    // second 4 KB buffer would not fit in RAM.
    int rc = inflate_zlib(in + 4, info->dataSize - 4, red_buf, 4096,
                          zlib_sink, NULL, total, &produced);

    if (zsink.panel_open) oepl_hw_spi_cs_deassert();

    if (rc != INFLATE_OK || zsink.failed || zsink.row_y != DISPLAY_HEIGHT_600X448) {
        rtt_puts("\r\nZIMG: decode failed rc=");
        rtt_put_hex8((uint8_t)(-rc));
        rtt_puts(" rows=");
        rtt_put_hex32(zsink.row_y);
        rtt_puts(" out=");
        rtt_put_hex32(produced);
        rtt_puts(" -- not refreshing\r\n");
        uc8159_sleep();
        return false;
    }

    rtt_puts("\r\nZIMG: decoded ");
    rtt_put_hex32(produced);
    rtt_puts(" bytes, checksum OK\r\n");

    // Refresh first, then tell the AP: transmitting during the refresh's peak
    // current loses the frame (see download_and_display).
    uc8159_refresh_and_sleep();
    rtt_puts(oepl_radio_send_xfer_complete()
                 ? "XferComplete ACKed\r\n"
                 : "XferComplete NOT acked (AP will re-offer)\r\n");
    return true;
}

// Download image and stream to display.
// On block download failure, fills with white and continues instead of aborting.
// Returns true if image was displayed (even partially).
static bool download_and_display(struct AvailDataInfo *info)
{
    uint32_t data_size = info->dataSize;
    uint8_t data_type = info->dataType;
    uint16_t width = DISPLAY_WIDTH_600X448;
    uint16_t height = DISPLAY_HEIGHT_600X448;
    uint16_t row_bytes = width / 8;           // 75 bytes per 1bpp row
    uint32_t plane_size = (uint32_t)row_bytes * height;  // 33,600 bytes
    bool has_red = (data_type == 0x21) && (data_size >= plane_size * 2);
    dl_failed_blocks = 0;
#ifdef DIAG_TELEMETRY
    g_diag_requests = g_diag_rf_nok = g_diag_rf_full = 0;
    uint8_t diag_xfer = 0;
#endif

    rtt_puts("DL+DISP: sz=");
    rtt_put_hex32(data_size);
    rtt_puts(" t=");
    rtt_put_hex8(data_type);
    rtt_puts(has_red ? " BWR" : " BW");
    rtt_puts("\r\n");

    bw_cache_id = -1;
    red_cache_id = -1;

    // Full re-init display before each update (UC8159 requires fresh init before each DRF)
    rtt_puts("EPD wake...");
    uc8159_wake();
    rtt_puts("OK\r\n");

    epd_begin_pixels();

    // Stream rows to display
    uint8_t bw_line[75];
    uint8_t red_line[75];
    uint8_t row_4bpp[300];

    for (uint16_t y = 0; y < height; y++) {
        // Abort at the first failed block: a partial image is never refreshed,
        // so downloading the rest would only burn radio time
        if (dl_failed_blocks >= 1) {
            rtt_puts("\r\nABORT: AP not serving data\r\n");
            break;   // no refresh will follow (see below), so stop streaming
        }

        uint32_t bw_offset = (uint32_t)y * row_bytes;

        // Get B/W line (failed blocks auto-fill white via ensure_bw_block)
        get_image_bytes(bw_offset, bw_line, row_bytes, info, false);

        // Get Red line (if 2bpp)
        if (has_red) {
            uint32_t red_offset = plane_size + (uint32_t)y * row_bytes;
            get_image_bytes(red_offset, red_line, row_bytes, info, true);
        } else {
            memset(red_line, 0, row_bytes);
        }

        // Convert to 4bpp (GD bit handles orientation)
        for (uint8_t x = 0; x < row_bytes; x++) {
            bwr_to_4bpp(bw_line[x], red_line[x], &row_4bpp[x * 4]);
        }

        // Send row to display
        oepl_hw_spi_send_raw(row_4bpp, 300);

        // Progress every 64 rows
        if ((y & 0x3F) == 0) {
            rtt_puts(".");
        }
    }

    oepl_hw_spi_cs_deassert();

    if (dl_failed_blocks > 0) {
        // Incomplete image: don't refresh. The panel keeps showing the last
        // good image (its RAM now holds the partial one, but nothing is
        // displayed until DRF), no XferComplete is sent, and the AP re-offers
        // the image at the next check-in. Refreshing here used to paint the
        // missing blocks white -- a whole white panel when the radio died
        // on the first block.
        rtt_puts("\r\nDATA PARTIAL (");
        rtt_put_hex8(dl_failed_blocks);
        rtt_puts(" failed) -- not refreshing\r\n");
        uc8159_sleep();
#ifdef DIAG_TELEMETRY
        oepl_radio_set_diag_report(dl_failed_blocks, 0,
                                   (uint8_t)(g_diag_requests > 255 ? 255 : g_diag_requests),
                                   (uint8_t)(g_diag_rf_nok > 255 ? 255 : g_diag_rf_nok),
                                   (uint8_t)(g_diag_rf_full > 255 ? 255 : g_diag_rf_full));
#endif
        return false;
    }
    rtt_puts("\r\nDATA OK\r\n");

    // Refresh the panel, wait it out, power it off. XferComplete must not be
    // sent until this returns: transmitting during the refresh's peak current
    // draw lost the (then unacknowledged) frame on most cycles, and the AP
    // kept re-offering the image.
    uc8159_refresh_and_sleep();

    // Only send XferComplete if download was fully successful.
    // On partial failure, AP keeps data pending for retry next checkin.
    if (dl_failed_blocks == 0) {
        if (oepl_radio_send_xfer_complete()) {
            rtt_puts("XferComplete ACKed\r\n");
#ifdef DIAG_TELEMETRY
            diag_xfer = g_xfer_last_try;
#endif
        } else {
            rtt_puts("XferComplete NOT acked (AP will re-offer)\r\n");
#ifdef DIAG_TELEMETRY
            diag_xfer = g_xfer_tx_ok ? 0xF : 0xE;
#endif
        }
    } else {
        rtt_puts("Skipping XferComplete (retry next checkin)\r\n");
    }
#ifdef DIAG_TELEMETRY
    oepl_radio_set_diag_report(dl_failed_blocks, diag_xfer,
                               (uint8_t)(g_diag_requests > 255 ? 255 : g_diag_requests),
                               (uint8_t)(g_diag_rf_nok > 255 ? 255 : g_diag_rf_nok),
                               (uint8_t)(g_diag_rf_full > 255 ? 255 : g_diag_rf_full));
#endif

