knyghtryda/oepl-cc2630-firmware/firmware/main.c
        // After sleep, RF core was shut down — re-init before next checkin
        {
            bool rf_ok = false;
            for (uint8_t retry = 0; retry < 5; retry++) {
                if (retry > 0) {
                    rtt_puts("RF re-init retry ");
                    rtt_put_hex8(retry);
                    rtt_puts("\r\n");
                    delay_cycles(48000000);  // ~1s delay between retries
                }
                rc = oepl_rf_init();
                if (rc == RF_OK) {
                    rf_ok = true;
                    break;
                }
            }
            if (!rf_ok) {
                // All retries failed — system reset instead of dying
                rtt_puts("RF re-init FAILED x5, RESET\r\n");
                // Brief delay so RTT/UART output flushes
                delay_cycles(4800000);
                // Reset via ROM Hard-API
                typedef void (*reset_fn_t)(void);
                uint32_t *hapi_table = (uint32_t *)0x10000048;
                reset_fn_t rom_reset = (reset_fn_t)hapi_table[6];
                rom_reset();
                // Should not reach here
                while (1) __asm volatile("nop");
            }
            oepl_radio_init();
        }

        checkin_count++;
    }

idle:
    // Fatal error — wait 10 seconds then reset to try again
    rtt_puts("Fatal error, reset in 10s\r\n");
    for (uint8_t i = 0; i < 10; i++)
        delay_cycles(48000000);  // ~1s each
    {
        typedef void (*reset_fn_t)(void);
        uint32_t *hapi_table = (uint32_t *)0x10000048;
        reset_fn_t rom_reset = (reset_fn_t)hapi_table[6];
        rom_reset();
    }
    while (1) __asm volatile("nop");

    return 0;
}
